from dataclasses import dataclass


@dataclass
class Tablo:
    '''Загруженная таблица из скрипта создания БД'''
    Namo: str
    '''Идентификатор таблицы в оригинальном регистре'''
    Descro: str
    '''Описание таблицы из MS-description или пустота при отсутствии'''
    PrKey: str
    '''Поля через запятую'''
    PrQwo: int
    '''Количество полей в ключе'''
    PrNamo: str
    '''Идентификатор ограничения'''
    Commento: str
    '''Комментарий из скрипта'''


@dataclass
class Fildo:
    '''Поля таблиц из скрипта создания БД'''
    Namo: str
    '''Идентификатор поля в оригинальном регистре'''
    Ordin: int
    '''Порядковый номер поля в скрипте создания таблицы'''
    Descro: str
    '''Описание поля из MS-description или пустота при отсутствии'''
    Typo: str
    '''Тип данных MS SQL'''
    Dln: int
    '''Длина или 0'''
    bNullo: bool
    '''Флаг допустимости Null'''
    bIdnty: bool
    '''Является ли автоинкрементным'''
    bDefo: bool
    '''Наличие констрейта (было только Default)'''
    zDefo: str
    '''Начальное значение'''
    nDefo: str
    '''Наименование ограничения'''
    bColla: bool
    '''Наличие блока Collate'''
    bUser: bool
    '''Флаг пользовательского типа данных'''
    nUser: str
    '''Идентификатор пользовательского типа данных'''
