from dataclasses import dataclass


@dataclass
class Conta:
    '''Внутренняя ссылка, обогащённая данными из содержания'''
    xrefa: int
    '''внутренний Id перекрёстной ссылки в pdf-документе'''
    frox: float
    '''Y-координата строки содержания на текущей странице'''
    fropigo: int
    '''Номер страницы, на которой расположена ссылка + 1'''
    pigo: int
    '''Номер страницы, на которую ссылается ссылка + 1'''
    toxo: float
    '''Координата X начала адресуемого текста'''
    toyo: float
    '''Координата Y начала адресуемого текста'''
    uro: str = ''
    '''URI внутренней ссылки'''
    koda: str = ''
    '''Иерархический код ссылочного пункта'''
    lvl: int = 13
    '''Уровень элемента'''
    lnom: int = 99
    '''Порядковый номер на текущем уровне'''
    namo: str = ''
    '''Наименование ссылочного пункта'''
    ida: int = 0
    '''Порядковый номер, ID'''
